#pragma once

// Name: WeHappyFew, Version: 1.8.8

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class GlimpseGame.1DInventoryView
// 0x0000 (0x0028 - 0x0028)
class U1DInventoryView : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.1DInventoryView");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseConversationAsset
// 0x0068 (0x0090 - 0x0028)
class UGlimpseConversationAsset : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x68];                                      // 0x0028(0x0068) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseConversationAsset");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseAnimationChain
// 0x0028 (0x0050 - 0x0028)
class UGlimpseAnimationChain : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0028(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseAnimationChain");
		return ptr;
	}

};


// Class GlimpseGame.PuppetShow
// 0x0010 (0x0038 - 0x0028)
class UPuppetShow : public UObject
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0028(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.PuppetShow");
		return ptr;
	}

};


// Class GlimpseGame.ActivePuppetShow
// 0x00E8 (0x0110 - 0x0028)
class UActivePuppetShow : public UObject
{
public:
	unsigned char                                      UnknownData00[0xE8];                                      // 0x0028(0x00E8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.ActivePuppetShow");
		return ptr;
	}


	void OnSkipCutscene();
};


// Class GlimpseGame.PuppetShowPlayer
// 0x0010 (0x0038 - 0x0028)
class UPuppetShowPlayer : public UObject
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0028(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.PuppetShowPlayer");
		return ptr;
	}

};


// Class GlimpseGame.ActorSensingComponent
// 0x0080 (0x0170 - 0x00F0)
class UActorSensingComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x80];                                      // 0x00F0(0x0080) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.ActorSensingComponent");
		return ptr;
	}


	void SetPeripheralVisionAngle(float NewPeripheralVisionAngle);
	void OnTimeOfDayChange();
	float GetVerticalVisionAngle();
	float GetSightVisionRadius();
	float GetProximityVisionRadius();
	float GetProximityVisionAngle();
	float GetPeripheralVisionAngle();
	float GetParacentralVisionAngle();
	float GetNearFrontVisionFactor();
	float GetNearAsideVisionFactor();
	float GetMaximumHearingRadius();
	float GetFurtherVisionRadius();
	float GetFurtherFrontVisionFactor();
	float GetFarFrontVisionFactor();
	float GetFarAsideVisionFactor();
	float GetCombatVisionRadius();
};


// Class GlimpseGame.AffectsDrugIntensityInterface
// 0x0000 (0x0028 - 0x0028)
class UAffectsDrugIntensityInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.AffectsDrugIntensityInterface");
		return ptr;
	}


	float GetDrugIntensity();
};


// Class GlimpseGame.AkEventsNotifyState
// 0x0010 (0x0040 - 0x0030)
class UAkEventsNotifyState : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0030(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.AkEventsNotifyState");
		return ptr;
	}

};


// Class GlimpseGame.AudioVolumeInsiderInterface
// 0x0000 (0x0028 - 0x0028)
class UAudioVolumeInsiderInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.AudioVolumeInsiderInterface");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseAudioVolume
// 0x00B0 (0x04E0 - 0x0430)
class AGlimpseAudioVolume : public AActor
{
public:
	unsigned char                                      UnknownData00[0xB0];                                      // 0x0430(0x00B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseAudioVolume");
		return ptr;
	}


	void OnEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int OtherBodyIndex);
	void OnBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
};


// Class GlimpseGame.AvailableDLC
// 0x0038 (0x0060 - 0x0028)
class UAvailableDLC : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0028(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.AvailableDLC");
		return ptr;
	}

};


// Class GlimpseGame.BarkNotify
// 0x0038 (0x0070 - 0x0038)
class UBarkNotify : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0038(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.BarkNotify");
		return ptr;
	}

};


// Class GlimpseGame.BarkNotifyState
// 0x0038 (0x0068 - 0x0030)
class UBarkNotifyState : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0030(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.BarkNotifyState");
		return ptr;
	}

};


// Class GlimpseGame.BountyComponent
// 0x0018 (0x0108 - 0x00F0)
class UBountyComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x00F0(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.BountyComponent");
		return ptr;
	}

};


// Class GlimpseGame.BTDecorator_AutoBase
// 0x0000 (0x0068 - 0x0068)
class UBTDecorator_AutoBase : public UBTDecorator
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.BTDecorator_AutoBase");
		return ptr;
	}

};


// Class GlimpseGame.BTDecorator_AttackAvailable
// 0x0028 (0x0090 - 0x0068)
class UBTDecorator_AttackAvailable : public UBTDecorator_AutoBase
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0068(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.BTDecorator_AttackAvailable");
		return ptr;
	}

};


// Class GlimpseGame.NeedPOIComponent
// 0x0158 (0x0248 - 0x00F0)
class UNeedPOIComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x158];                                     // 0x00F0(0x0158) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.NeedPOIComponent");
		return ptr;
	}


	void SetSlotMontage(class UAnimMontage* Montage, int SlotIndex);
	void OnConversationFinished(bool bSuccess);
	bool IsReserved(class AGlimpseAICharacter* UserCharacter);
	bool IsInUse();
	bool IsBlocked();
	struct FVector GetSlotLocation(int SlotIndex);
};


// Class GlimpseGame.GlimpseAIController
// 0x05F0 (0x0B10 - 0x0520)
class AGlimpseAIController : public AAIController
{
public:
	unsigned char                                      UnknownData00[0x5F0];                                     // 0x0520(0x05F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseAIController");
		return ptr;
	}


	bool UseAlternateLookAtWeights();
	void SwitchRootBehaviour_Specific(class UBehaviorTree* Behaviour);
	void SwitchRootBehaviour(TEnumAsByte<EAICustomBehaviour> Type);
	void SwitchBehaviour(TEnumAsByte<EAICustomBehaviour> Type, class UBehaviorTree* Behaviour);
	bool SuspendBehaviour(class UObject* ContextObject);
	void SetTargetLocation(const struct FVector& NewLocation);
	void SetTargetActor(class AActor* Actor);
	void SetSuspicionValue(float InSuspicionValue);
	void SetSuspicionState(TEnumAsByte<EAISuspicionState> InSuspicionState);
	void SetSpawner(class AGlimpseAISpawner* Spawner);
	void SetPatrolActor(class AActor* Actor);
	void SetMovementSpeed(TEnumAsByte<EWalkPace> Pace);
	void SetMoraleState(TEnumAsByte<EAIMoraleState> InMoraleState, float Duration);
	void SetLookAtOverride(class UObject* Source, class AActor* LookAtActor);
	void SetLookAtActorKey(const struct FBlackboardKeySelector& BBKey);
	void SetDetectionTarget(class AActor* InDetectionTarget);
	void SetDefaultRootBehaviour(class UBehaviorTree* Behaviour);
	bool SenseActor_Vision(class AActor* InSensePawn);
	bool SenseActor_Hearing(class AActor* InSensePawn, bool bCanSee);
	bool SenseActor_Direct(class AActor* InSensePawn, float DirectRange);
	void ResumeRootBehaviour();
	bool ResumeBehaviour(class UObject* ContextObject);
	void OnCharacterTakeDamage(class AActor* DamagedActor, float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
	void OnCharacterShoved(class AGlimpseCharacter* ShoveSource, const struct FName& ShoveMoveName);
	bool HaveLineOfSightOnTarget(float Tolerance);
	float GetTargetCooldownEndTime(class AGlimpseCharacter* Target, const struct FGameplayTag& CooldownTag);
	class AActor* GetTargetActor();
	float GetSuspicionValue();
	TEnumAsByte<EAISuspicionState> GetSuspicionState();
	class AActor* GetPatrolActor();
	TEnumAsByte<EAIMoraleState> GetMoraleState();
	struct FVector GetLookAtLocation();
	class AActor* GetLookAtActor();
	class AActor* GetDetectionTarget();
	class UBehaviorTree* GetDefaultRootBehaviour();
	void FaceLookAtActor(bool bEnabled);
	void ClearSuspicion();
	void ClearPatrolActor(bool TestNavMesh);
	void ClearLookAtOverride(class UObject* Source);
	void AddSuspicionValue(float InSuspicionValue);
	void AddCooldownTargetDuration(class AGlimpseCharacter* Target, const struct FGameplayTag& CooldownTag, float CooldownDuration, bool bAddToExistingDuration);
};


// Class GlimpseGame.BTDecorator_CharacterStat
// 0x0038 (0x00A0 - 0x0068)
class UBTDecorator_CharacterStat : public UBTDecorator
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0068(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.BTDecorator_CharacterStat");
		return ptr;
	}

};


// Class GlimpseGame.BTDecorator_DynamicallySpawn
// 0x0000 (0x0068 - 0x0068)
class UBTDecorator_DynamicallySpawn : public UBTDecorator
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.BTDecorator_DynamicallySpawn");
		return ptr;
	}

};


// Class GlimpseGame.BTDecorator_FindCharacters
// 0x0018 (0x0080 - 0x0068)
class UBTDecorator_FindCharacters : public UBTDecorator
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0068(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.BTDecorator_FindCharacters");
		return ptr;
	}

};


// Class GlimpseGame.BTDecorator_FindPOI
// 0x0008 (0x0070 - 0x0068)
class UBTDecorator_FindPOI : public UBTDecorator
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0068(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.BTDecorator_FindPOI");
		return ptr;
	}

};


// Class GlimpseGame.BTDecorator_IsActorInArena
// 0x0028 (0x0090 - 0x0068)
class UBTDecorator_IsActorInArena : public UBTDecorator
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0068(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.BTDecorator_IsActorInArena");
		return ptr;
	}

};


// Class GlimpseGame.BTDecorator_IsPlayerInConvo
// 0x0008 (0x0070 - 0x0068)
class UBTDecorator_IsPlayerInConvo : public UBTDecorator
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0068(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.BTDecorator_IsPlayerInConvo");
		return ptr;
	}

};


// Class GlimpseGame.BTDecorator_LocationAvailable
// 0x0058 (0x00C0 - 0x0068)
class UBTDecorator_LocationAvailable : public UBTDecorator
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0068(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.BTDecorator_LocationAvailable");
		return ptr;
	}

};


// Class GlimpseGame.BTDecorator_IsInCombatRange
// 0x0008 (0x0098 - 0x0090)
class UBTDecorator_IsInCombatRange : public UBTDecorator_BlackboardBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0090(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.BTDecorator_IsInCombatRange");
		return ptr;
	}

};


// Class GlimpseGame.BTDecorator_PuppetBrainTask
// 0x0000 (0x00C0 - 0x00C0)
class UBTDecorator_PuppetBrainTask : public UBTDecorator_Blackboard
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.BTDecorator_PuppetBrainTask");
		return ptr;
	}

};


// Class GlimpseGame.BTDecorator_Message
// 0x0010 (0x0078 - 0x0068)
class UBTDecorator_Message : public UBTDecorator
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0068(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.BTDecorator_Message");
		return ptr;
	}

};


// Class GlimpseGame.BTDecorator_SetArena
// 0x0058 (0x00C0 - 0x0068)
class UBTDecorator_SetArena : public UBTDecorator
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0068(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.BTDecorator_SetArena");
		return ptr;
	}

};


// Class GlimpseGame.BTDecorator_ShouldRunDecorator
// 0x0000 (0x0068 - 0x0068)
class UBTDecorator_ShouldRunDecorator : public UBTDecorator
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.BTDecorator_ShouldRunDecorator");
		return ptr;
	}

};


// Class GlimpseGame.BTDecorator_TargetCooldown
// 0x0038 (0x00A0 - 0x0068)
class UBTDecorator_TargetCooldown : public UBTDecorator
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0068(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.BTDecorator_TargetCooldown");
		return ptr;
	}

};


// Class GlimpseGame.BTDecorator_TimeInterval
// 0x0010 (0x0078 - 0x0068)
class UBTDecorator_TimeInterval : public UBTDecorator
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0068(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.BTDecorator_TimeInterval");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseWorldStyle
// 0x0050 (0x0078 - 0x0028)
class UGlimpseWorldStyle : public UObject
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x0028(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseWorldStyle");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseFootprint
// 0x0050 (0x0078 - 0x0028)
class UGlimpseFootprint : public UObject
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x0028(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseFootprint");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseRoadDecorationSet
// 0x0020 (0x0048 - 0x0028)
class UGlimpseRoadDecorationSet : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0028(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseRoadDecorationSet");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseTaggedDecorationSet
// 0x0010 (0x0038 - 0x0028)
class UGlimpseTaggedDecorationSet : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0028(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseTaggedDecorationSet");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseDecorator
// 0x00A0 (0x00C8 - 0x0028)
class UGlimpseDecorator : public UObject
{
public:
	unsigned char                                      UnknownData00[0xA0];                                      // 0x0028(0x00A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseDecorator");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseLayoutActor
// 0x00B0 (0x04E0 - 0x0430)
class AGlimpseLayoutActor : public AActor
{
public:
	unsigned char                                      UnknownData00[0xB0];                                      // 0x0430(0x00B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseLayoutActor");
		return ptr;
	}


	struct FGlimpseRandomStream STATIC_RandomStream(struct FGlimpseRandomStream* Stream);
	int STATIC_RandomInt(int MinValue, int MaxValuePlusOne, struct FGlimpseRandomStream* Stream);
	float STATIC_RandomFloat(float MinValue, float MaxValue, struct FGlimpseRandomStream* Stream);
	struct FVector2D STATIC_RandomDirection(float MeanAngle, float DeltaAngle, float StandardDeviation, struct FGlimpseRandomStream* Stream);
	void OnWorldBuilderComplete(bool bLoadingSaveGame);
	void OnPlayerPlaced(bool bLoadingSaveGame);
	struct FRotator STATIC_GetComponentRelativeRotation(class USceneComponent* Component);
	struct FVector STATIC_GetComponentRelativeLocation(class USceneComponent* Component);
};


// Class GlimpseGame.GameplayVolumeInsiderInterface
// 0x0000 (0x0028 - 0x0028)
class UGameplayVolumeInsiderInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GameplayVolumeInsiderInterface");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseGameplayVolume
// 0x0120 (0x0550 - 0x0430)
class AGlimpseGameplayVolume : public AActor
{
public:
	unsigned char                                      UnknownData00[0x120];                                     // 0x0430(0x0120) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseGameplayVolume");
		return ptr;
	}


	void OnEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int OtherBodyIndex);
	void OnBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ChangeTrespassingFlag(bool bNewFlag);
	void ChangeStealingFlag(bool bNewFlag);
	void ChangeNoWaitingFlag(bool bNewFlag);
	void ChangeNoSavingFlag(bool bNewFlag);
	void ChangeNoFastTravelFlag(bool bNewFlag);
};


// Class GlimpseGame.GlimpsePickup
// 0x02A0 (0x0780 - 0x04E0)
class AGlimpsePickup : public AGlimpseLayoutActor
{
public:
	unsigned char                                      UnknownData00[0x2A0];                                     // 0x04E0(0x02A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpsePickup");
		return ptr;
	}


	void OnOverlapCallback(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnHitCallback(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void OnEnterInventory(class UInventoryComponent* NewOwner, bool bRestoringInventory);
	void OnEndInteraction(class APawn* InteractSource);
	void OnDropped(class AGlimpseCharacter* DroppingCharacter);
	void OnCompleteInteraction(class APawn* InteractSource);
	TEnumAsByte<EInteractionResult> OnCanInteract(class APawn* InteractSource);
	void OnBeginInteraction(class APawn* InteractSource);
	bool IsEquipped();
	bool IsBeingUnequipped();
	bool IsBeingEquipped();
	struct FText GetUseEquipText();
	TEnumAsByte<EStandardAnimationMovement> GetMovementTypeWhenEquipped();
	class AGlimpseCharacter* GetLastCharacterOwner();
	TArray<struct FInventoryItemStat> GetItemStats();
	class AGlimpseCharacter* GetCharacterOwner();
	void DelayedDestroy();
	void DamageDurability(float DurabilityCost, bool bPlayFX, bool bApplyDurabilityTags);
	bool CanInteractWhenEquipped();
	bool CanCrouchWhenEquipped();
	void AbandonPickupSpawner();
};


// Class GlimpseGame.Quest
// 0x0398 (0x03C0 - 0x0028)
class UQuest : public UObject
{
public:
	unsigned char                                      UnknownData00[0x398];                                     // 0x0028(0x0398) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.Quest");
		return ptr;
	}


	void SetQuestState(const struct FName& State);
	void SetObjectiveStatus(const struct FName& ObjectiveKey, TEnumAsByte<EObjectiveStatus> InStatus, bool bForceActivate);
	void SetObjectiveCounter(const struct FName& ObjectiveKey, int NewCount, bool bForceActivate);
	void ResetQuest();
	void ReceiveQuestUpdated(class AGlimpsePlayerController* Controller, TEnumAsByte<EQuestStatus> status);
	void ReceiveQuestUnbound();
	void ReceiveQuestBound(class AGlimpsePlayerController* Controller);
	void ReceiveObjectiveUpdated(class AGlimpsePlayerController* Controller, const struct FObjective& Objective, TEnumAsByte<EObjectiveStatus> status);
	bool IsVariableBound(const struct FName& Variable);
	bool IsContextBound(const struct FName& BindContext);
	bool IsBound();
	void IncrementObjectiveCounter(const struct FName& ObjectiveKey, int Increment, bool bForceActivate);
	TEnumAsByte<EQuestStatus> GetQuestStatus();
	struct FName GetQuestState();
	struct FName GetQuestKey();
	TArray<struct FName> GetObjectivesWithStatus(TEnumAsByte<EObjectiveStatus> status);
	TEnumAsByte<EObjectiveStatus> GetObjectiveStatus(const struct FName& ObjectiveKey);
	int GetObjectiveCounter(const struct FName& ObjectiveKey);
	void GetCurrentObjective(struct FName* ObjectiveName, bool* MultipleObjectives);
	void FailQuest();
	void DeactivateObjective(const struct FName& ObjectiveKey);
	void CompleteQuest();
	void ActivateQuest();
};


// Class GlimpseGame.GlimpseSpawnModel
// 0x0188 (0x01B0 - 0x0028)
class UGlimpseSpawnModel : public UObject
{
public:
	unsigned char                                      UnknownData00[0x188];                                     // 0x0028(0x0188) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseSpawnModel");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseSaveGameInterface
// 0x0000 (0x0028 - 0x0028)
class UGlimpseSaveGameInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseSaveGameInterface");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseStreamingProxy
// 0x0058 (0x0080 - 0x0028)
class UGlimpseStreamingProxy : public UObject
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0028(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseStreamingProxy");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseStreamingLevel
// 0x00C8 (0x00F0 - 0x0028)
class UGlimpseStreamingLevel : public UObject
{
public:
	unsigned char                                      UnknownData00[0xC8];                                      // 0x0028(0x00C8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseStreamingLevel");
		return ptr;
	}


	void OnLevelUnloaded();
	void OnLevelShown();
	void OnLevelLoaded();
	void OnLevelHidden();
};


// Class GlimpseGame.GlimpseStreamingManager
// 0x07A8 (0x07D0 - 0x0028)
class UGlimpseStreamingManager : public UObject
{
public:
	unsigned char                                      UnknownData00[0x7A8];                                     // 0x0028(0x07A8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseStreamingManager");
		return ptr;
	}


	struct FName STATIC_GetFeatureInstanceNameFromLevel(class ULevel* Level);
	struct FName STATIC_GetFeatureInstanceNameFromActor(class AActor* Actor);
};


// Class GlimpseGame.GlimpseWorldElement
// 0x01D0 (0x01F8 - 0x0028)
class UGlimpseWorldElement : public UObject
{
public:
	unsigned char                                      UnknownData00[0x1D0];                                     // 0x0028(0x01D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseWorldElement");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseWorldIntersection
// 0x0138 (0x0330 - 0x01F8)
class UGlimpseWorldIntersection : public UGlimpseWorldElement
{
public:
	unsigned char                                      UnknownData00[0x138];                                     // 0x01F8(0x0138) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseWorldIntersection");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseWorldRoad
// 0x0188 (0x0380 - 0x01F8)
class UGlimpseWorldRoad : public UGlimpseWorldElement
{
public:
	unsigned char                                      UnknownData00[0x188];                                     // 0x01F8(0x0188) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseWorldRoad");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseAIClass
// 0x0018 (0x0040 - 0x0028)
class UGlimpseAIClass : public UObject
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0028(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseAIClass");
		return ptr;
	}

};


// Class GlimpseGame.BTDecorator_Random
// 0x0008 (0x0070 - 0x0068)
class UBTDecorator_Random : public UBTDecorator
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0068(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.BTDecorator_Random");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseWorldStreet
// 0x0020 (0x0218 - 0x01F8)
class UGlimpseWorldStreet : public UGlimpseWorldElement
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x01F8(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseWorldStreet");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseWorldCycle
// 0x0028 (0x0220 - 0x01F8)
class UGlimpseWorldCycle : public UGlimpseWorldElement
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x01F8(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseWorldCycle");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseWorldDecoration
// 0x0048 (0x0240 - 0x01F8)
class UGlimpseWorldDecoration : public UGlimpseWorldElement
{
public:
	unsigned char                                      UnknownData00[0x48];                                      // 0x01F8(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseWorldDecoration");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseWorldExclude
// 0x0000 (0x01F8 - 0x01F8)
class UGlimpseWorldExclude : public UGlimpseWorldElement
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseWorldExclude");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseZoningInterface
// 0x0000 (0x0028 - 0x0028)
class UGlimpseZoningInterface : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseZoningInterface");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseWorldBridge
// 0x0050 (0x0248 - 0x01F8)
class UGlimpseWorldBridge : public UGlimpseWorldElement
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x01F8(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseWorldBridge");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseWorldEncounter
// 0x0048 (0x0240 - 0x01F8)
class UGlimpseWorldEncounter : public UGlimpseWorldElement
{
public:
	unsigned char                                      UnknownData00[0x48];                                      // 0x01F8(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseWorldEncounter");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseWorldFiller
// 0x0050 (0x0248 - 0x01F8)
class UGlimpseWorldFiller : public UGlimpseWorldElement
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x01F8(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseWorldFiller");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseWorldWall
// 0x0130 (0x0328 - 0x01F8)
class UGlimpseWorldWall : public UGlimpseWorldElement
{
public:
	unsigned char                                      UnknownData00[0x130];                                     // 0x01F8(0x0130) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseWorldWall");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseWorldBiome
// 0x0008 (0x0200 - 0x01F8)
class UGlimpseWorldBiome : public UGlimpseWorldElement
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x01F8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseWorldBiome");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseWorldGraph
// 0x0108 (0x0130 - 0x0028)
class UGlimpseWorldGraph : public UObject
{
public:
	unsigned char                                      UnknownData00[0x108];                                     // 0x0028(0x0108) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseWorldGraph");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseIntersection
// 0x0070 (0x0550 - 0x04E0)
class AGlimpseIntersection : public AGlimpseLayoutActor
{
public:
	unsigned char                                      UnknownData00[0x70];                                      // 0x04E0(0x0070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseIntersection");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseRoadModel
// 0x0330 (0x0358 - 0x0028)
class UGlimpseRoadModel : public UObject
{
public:
	unsigned char                                      UnknownData00[0x330];                                     // 0x0028(0x0330) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseRoadModel");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseHighwayManager
// 0x0068 (0x0090 - 0x0028)
class UGlimpseHighwayManager : public UObject
{
public:
	unsigned char                                      UnknownData00[0x68];                                      // 0x0028(0x0068) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseHighwayManager");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseAIManager
// 0x03B8 (0x03E0 - 0x0028)
class UGlimpseAIManager : public UObject
{
public:
	unsigned char                                      UnknownData00[0x3B8];                                     // 0x0028(0x03B8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseAIManager");
		return ptr;
	}


	void OnMorning();
	void OnEvening();
};


// Class GlimpseGame.GlimpseActiveConversation
// 0x00F0 (0x0118 - 0x0028)
class UGlimpseActiveConversation : public UObject
{
public:
	unsigned char                                      UnknownData00[0xF0];                                      // 0x0028(0x00F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseActiveConversation");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseSuspicionComposite
// 0x0020 (0x0048 - 0x0028)
class UGlimpseSuspicionComposite : public UObject
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0028(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseSuspicionComposite");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseSuspicionContext
// 0x0140 (0x0188 - 0x0048)
class UGlimpseSuspicionContext : public UGlimpseSuspicionComposite
{
public:
	unsigned char                                      UnknownData00[0x140];                                     // 0x0048(0x0140) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseSuspicionContext");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseSuspicionAttractor
// 0x0038 (0x01C0 - 0x0188)
class UGlimpseSuspicionAttractor : public UGlimpseSuspicionContext
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0188(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseSuspicionAttractor");
		return ptr;
	}

};


// Class GlimpseGame.SecurityNodeComponent
// 0x00D0 (0x01C0 - 0x00F0)
class USecurityNodeComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0xD0];                                      // 0x00F0(0x00D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.SecurityNodeComponent");
		return ptr;
	}


	void ToggleNode(class APawn* Instigator);
	void RestoreNode(class APawn* Instigator);
	bool IsNodeActive();
	void DisableNode(class APawn* Instigator);
	void DeactivateNode(class APawn* Instigator);
	void ActivateNode(class APawn* Instigator);
};


// Class GlimpseGame.GlimpseSecurityAlarm
// 0x0060 (0x0490 - 0x0430)
class AGlimpseSecurityAlarm : public AActor
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x0430(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseSecurityAlarm");
		return ptr;
	}


	void OnNodeDeactivated(class USecurityNodeComponent* InSecurityNode, class APawn* InInstigator);
	void OnNodeActivated(class USecurityNodeComponent* InSecurityNode, class APawn* InInstigator, class USecurityNodeComponent* TriggerNode);
	bool IsActive();
	void Deactivate(class APawn* InInstigator);
	void Activate(class APawn* InInstigator, class USecurityNodeComponent* TriggerNode);
};


// Class GlimpseGame.GlimpseSearchPointComponent
// 0x0070 (0x03D0 - 0x0360)
class UGlimpseSearchPointComponent : public USceneComponent
{
public:
	unsigned char                                      UnknownData00[0x70];                                      // 0x0360(0x0070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseSearchPointComponent");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseArenaAnchor
// 0x0030 (0x0460 - 0x0430)
class AGlimpseArenaAnchor : public AActor
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0430(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseArenaAnchor");
		return ptr;
	}

};


// Class GlimpseGame.GlimpseSuspicionCharacter
// 0x02A8 (0x0430 - 0x0188)
class UGlimpseSuspicionCharacter : public UGlimpseSuspicionContext
{
public:
	unsigned char                                      UnknownData00[0x2A8];                                     // 0x0188(0x02A8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseSuspicionCharacter");
		return ptr;
	}


	void SetSuspicionState(class AGlimpseAIController* Agent, TEnumAsByte<EAISuspicionState> State, TEnumAsByte<EGlimpseSuspicionReason> Reason);
	int GetNumAgents();
	TEnumAsByte<ESuspicionConformityRequest> GetConformityType();
	void ClearSuspicionState(class AGlimpseAIController* Agent, TEnumAsByte<EGlimpseResignReason> Reason);
	bool AnyAgentHasLineOfSight();
	bool AgentHasLineOfSight(class AGlimpseAIController* Agent);
};


// Class GlimpseGame.GlimpseSuspicionManager
// 0x0098 (0x00E0 - 0x0048)
class UGlimpseSuspicionManager : public UGlimpseSuspicionComposite
{
public:
	unsigned char                                      UnknownData00[0x98];                                      // 0x0048(0x0098) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseSuspicionManager");
		return ptr;
	}


	class AGlimpseAICharacter* STATIC_SpawnEnemyForFight(const struct FName& FightTag, const struct FTransform& EnemyTransform, class UClass* EnemyClass, class UBehaviorTree* EnemyBehavior);
	void STATIC_IgnoreSuspicionForTarget(bool NoSuspicion, class AActor* SuspicionTarget);
	void STATIC_ForceSuspicionForTarget(TEnumAsByte<EAISuspicionState> SuspicionState, class AActor* SuspicionTarget, bool SuspicionIsLocked, class AGlimpseAIController* Agent);
	void STATIC_ForceSuspicion(class AGlimpseAIController* AgentController, TEnumAsByte<EAISuspicionState> SuspicionState, bool SuspicionIsLocked);
	class UGlimpseSuspicionContext* STATIC_CreateAttractorForTarget(TEnumAsByte<EGlimpseSuspicionPriority> SuspicionType, class AActor* SuspicionTarget);
	int STATIC_CreateAttractorForSearch(const struct FName& AlarmTag);
	void STATIC_ClearSuspicionForTarget(class AActor* SuspicionTarget);
	void STATIC_ClearAttractorFromSearch();
	void STATIC_ClearAttractorForTarget(class AActor* SuspicionTarget);
	void STATIC_AgentIgnoreSuspicionForTarget(bool NoSuspicion, class AGlimpseAIController* Agent, class AActor* SuspicionTarget);
};


// Class GlimpseGame.GlimpseGameMode
// 0x1290 (0x1790 - 0x0500)
class AGlimpseGameMode : public AGameMode
{
public:
	unsigned char                                      UnknownData00[0x1290];                                    // 0x0500(0x1290) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseGameMode");
		return ptr;
	}


	void ToggleHandsTooClose();
	void ToggleCombatToken();
	float TimeSinceAttackUsedGlobally(const struct FName& AttackName);
	void StartCustomBroadcast(const struct FName& BroadcastKey, float StartTime, bool bTV, bool bRadio, bool bPA);
	void ShowVisionRanges();
	void ShowSuspicionHistory();
	void ShowSmell();
	void ShowPOI();
	void ShowNoise();
	void ShowNeedsIcons();
	void ShowDebugHandsTooClose();
	void ShowCombat();
	void ShowCharge();
	void SetTime(int Hours, int Minutes, bool bNotifyObservers);
	void SetGameFlagValue(const struct FName& InName, int Value);
	void SetGameFlag(const struct FName& InName);
	void SetDayAndTime(int InDay, int InHours, int InMinutes);
	void SetDay(int InDay);
	void ResetTimeScaleOverride();
	void ResetGameFlags();
	float RealTimeToGameTime(float InRealTime);
	void OverrideTimeScale(float InTimeScaleOverride);
	void NoSuspicion();
	void NoMusic();
	void NoAISpawns();
	void MarkDLCIntegrated(const struct FName& DLCName, const struct FIntPoint& Version);
	void LogGameFlags();
	void ListBroadcasts();
	bool IsPermadeath();
	bool IsGameFlagSet(const struct FName& InName);
	bool IsDLCIntegrated(const struct FName& DLCName);
	struct FTimespan GetTimestamp();
	float GetTimeScale();
	void GetTimeOfDayTime(TEnumAsByte<ETimeOfDay> InTimeOfDay, unsigned char* OutHours, unsigned char* OutMinutes, unsigned char* OutSeconds);
	int GetTimeOfDaySerial();
	float GetTimeOfDayFraction(TEnumAsByte<ETimeOfDay> InTimeOfDay);
	TEnumAsByte<ETimeOfDay> GetTimeOfDay();
	float GetTimeFraction();
	void GetTime(unsigned char* OutHours, unsigned char* OutMinutes, unsigned char* OutSeconds);
	TEnumAsByte<EGlimpseGameDifficulty> GetSuspicionDifficulty();
	TEnumAsByte<EGlimpseGameDifficulty> GetSurvivalDifficulty();
	struct FSandboxStatistics GetSandboxStatistics();
	class UGlimpseNewspaper* GetNewspaper();
	struct FIntPoint GetIntegratedDLCVersion(const struct FName& DLCName);
	int GetGameFlag(const struct FName& InName);
	TEnumAsByte<EGlimpseGameDifficulty> GetGameDifficulty();
	unsigned char GetDay();
	struct FDateTime GetDateTime(bool ReturnNowIfTimeDoesntMove);
	TEnumAsByte<EStoryCharacter> GetCurrentCharacterType();
	TEnumAsByte<EGlimpseGameDifficulty> GetCombatDifficulty();
	class UGlimpseBroadcaster* GetBroadcaster();
	float GameTimeToRealTime(float InGameTime);
	void EnableSpawnWithinLiveness();
	bool DoesDifficultyRequireNeed(TEnumAsByte<ESurvivalNeed> SurvivalNeed);
	void DisableSpawnWithinLiveness();
	void ClearGameFlag(const struct FName& InName);
	void AlwaysShowSuspicion();
	void AdvanceToTime(int Hours, int Minutes, bool bNotifyObservers);
	void AdvanceOneDay(bool bNotifyObservers);
	void AddTimespanObserver(const struct FScriptDelegate& Delegate, const struct FTimespan& InTime, bool bOnce);
	void AddTimeOfDayObserver(const struct FScriptDelegate& Delegate, TEnumAsByte<ETimeOfDay> InTimeOfDay, bool bOnce);
	void AddTimeObserver(const struct FScriptDelegate& Delegate, int InHours, int InMinutes, int InSeconds, bool bOnce);
	void AddTimeDelayObserver(const struct FScriptDelegate& Delegate, int InDelayHours, int InDelayMinutes);
	void AddTime(int Hours, int Minutes, bool bNotifyObservers);
	void AddAutoApplyEffect(class UClass* StatusEffect);
};


// Class GlimpseGame.GlimpseBroadcaster
// 0x0140 (0x0168 - 0x0028)
class UGlimpseBroadcaster : public UObject
{
public:
	unsigned char                                      UnknownData00[0x140];                                     // 0x0028(0x0140) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseBroadcaster");
		return ptr;
	}


	void RemoveBroadcastsObserver(const struct FScriptDelegate& Delegate);
	void RemoveBroadcastActor(class AActor* Actor);
	bool IsBroadcastActor(class AActor* Actor);
	class UTexture* GetBroadcastVideoTexture();
	class UMaterialInterface* GetBroadcastVideoMaterialByName(const struct FString& MaterialName);
	class UMaterialInterface* GetBroadcastVideoMaterialByIndex(int Index);
	void EndPlayBroadcastActor(class AActor* Actor, TEnumAsByte<EEndPlayReason> Reason);
	void AddManualBroadcastActor(class AActor* Actor, TEnumAsByte<EGlimpseBroadcastType> BroadcastType, bool bLongRange, bool bDontPlayIntermissionAudio);
	void AddBroadcastsObserver(const struct FScriptDelegate& Delegate);
	void AddBroadcastActor(class AActor* Actor, TEnumAsByte<EGlimpseBroadcastType> BroadcastType, bool bLongRange, bool bDontPlayIntermissionAudio);
};


// Class GlimpseGame.GlimpseAssetCache
// 0x02B8 (0x02E0 - 0x0028)
class UGlimpseAssetCache : public UObject
{
public:
	unsigned char                                      UnknownData00[0x2B8];                                     // 0x0028(0x02B8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseAssetCache");
		return ptr;
	}

};


// Class GlimpseGame.GlimpsePlayerSpawn
// 0x0000 (0x0430 - 0x0430)
class AGlimpsePlayerSpawn : public AActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpsePlayerSpawn");
		return ptr;
	}


	void UnlockAsShelterSpawn(const struct FName& ShelterName);
	void OnRespawn(class AGlimpsePlayerCharacter* PlayerCharacter);
};


// Class GlimpseGame.GlimpseSubtitleManager
// 0x0220 (0x0248 - 0x0028)
class UGlimpseSubtitleManager : public UObject
{
public:
	unsigned char                                      UnknownData00[0x220];                                     // 0x0028(0x0220) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpseSubtitleManager");
		return ptr;
	}

};


// Class GlimpseGame.RecurringTaskComponent
// 0x0028 (0x0118 - 0x00F0)
class URecurringTaskComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x00F0(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.RecurringTaskComponent");
		return ptr;
	}


	void SetTaskPerformed(const struct FName& TaskName);
	void RemoveTimeModifier(const struct FName& ModifierName, const struct FName& TaskName);
	void RemoveRecurringTask(const struct FName& TaskName);
	bool GetTimeUntilTaskDue(const struct FName& TaskName, struct FTimespan* OutTimeUntilTaskDue);
	void AddOrUpdateTimeModifier(const struct FName& ModifierName, const struct FName& TaskName, const struct FTimespan& DurationUntilDue, float ModifierPercentage);
	void AddOrUpdateRecurringTask(const struct FName& TaskName, const struct FTimespan& DurationUntilDue, bool bPermanent);
};


// Class GlimpseGame.GlimpsePlayerController
// 0x0D10 (0x1470 - 0x0760)
class AGlimpsePlayerController : public APlayerController
{
public:
	unsigned char                                      UnknownData00[0xD10];                                     // 0x0760(0x0D10) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.GlimpsePlayerController");
		return ptr;
	}


	void ViewNextLore(const struct FName& LoreKey);
	void ViewLore(const struct FName& LoreKey, int LoreIndex);
	void UpdateAchievementProgress(const struct FString& AchievementName, float Percent);
	void UnlockRecipe(class UClass* RecipeType);
	void ToggleWeapon();
	void SuspendNotifications();
	void Suicide();
	bool StartExplictInteraction(class UInteractionComponent* Interaction, bool bSkipCheck);
	void ShowTutorialWidget(const struct FName& TipKey);
	void ShowStashMenu();
	void ShowSleepDurationBox(class UObject* Source);
	void ShowPlayerMenuWithContext(TEnumAsByte<EPlayerMenu> MenuType, const struct FName& ContextKey);
	void ShowPlayerMenu(TEnumAsByte<EPlayerMenu> MenuType);
	void ShowNotificationByKeyWithContext(const struct FName& NotificationKey, TEnumAsByte<EPlayerMenu> Menu, const struct FName& Context, bool bUseCheckmark);
	void ShowNotificationByKeyWithArgs(const struct FName& NotificationKey, TArray<struct FString> ArgKeys, TArray<struct FText> ArgText);
	void ShowNotificationByKey(const struct FName& NotificationKey);
	void ShowNotification(const struct FNotification& InNotification);
	void ShowMessageBoxConfirm(const struct FText& Title, const struct FText& Body, const struct FScriptDelegate& ConfirmCallback, const struct FScriptDelegate& CancelCallback);
	void ShowInGameTipByKey(const struct FName& TipKey);
	void ShowInGameTip(const struct FInGameTip& InGameTip);
	void ShowDeathMenu(TEnumAsByte<EDeathScreen> DeathType, const struct FScriptDelegate& MenuHiddenCallback);
	bool ShouldDisableHeadBobbing();
	void SetTutorialStep(int step);
	void SetTargetLocked(bool bLocked);
	void SetTargetActor(class AActor* NewTargetActor, bool bForce);
	void SetShowMainSheltersOnMap(bool Show);
	void SetProfileFlagValue(const struct FName& InName, int Value);
	void SetProfileFlag(const struct FName& InName);
	void SetPlayerSubMenuEnabled(TEnumAsByte<EPlayerMenu> MenuType, bool Enabled);
	void SetPlayerMaxCarryWeightOffset(float Val);
	void SetEnableOverrideConformityRequests(bool bInEnable);
	void SetCutsceneInputMode(bool bActivate, bool bSuppressLetterbox);
	void SetConversationTargetActor(class AActor* InTarget);
	void SetConversationTarget(class AGlimpseCharacter* InTarget);
	void SetConversationModeSettings(const struct FConversationModeSettings& InSettings);
	void SetConformityAnnoyedReasonOverride(const struct FName& InAnnoyedReason);
	void SetCanUseHandsForEquippablesOrItems(bool CanUse);
	void SetCanCraftWithStash(bool Val);
	void SetCanAccessPlayerMenu(bool CanAccess);
	void SetBridgeChallengeComplete(const struct FVector& WorldLocation);
	void SetAllowGameModeMenu(bool NewValue);
	void ResumeNotifications(bool bCatchUp, bool NotSecondary);
	void ResetViewedInGameTips();
	void ResetCutscene();
	void ResetCompletedBridges();
	void ResetCollectibles();
	void ResetCinematicMode();
	void ResetAchievements();
	void RemoveOverrideConformityRequest(const struct FName& InRequest);
	void RemoveGameplayCountdown(const struct FName& CountdownReference);
	void RemoveAllGameplayCountdowns();
	void RefreshTargetInteraction();
	void RebuildInventoryFromDump();
	void QuickSave();
	void QuickLoad();
	void PushConversationModeWithSkip();
	void PushConversationModeWithoutSkip();
	void PushConversationMode();
	void PopConversationMode();
	void OnStatusEffectRemoved(class UGlimpseStatusEffectBase* Effect);
	void OnStatusEffectApplied(class UGlimpseStatusEffectBase* Effect);
	void OnCountdownComplete(const struct FName& CountdownReference);
	void OnCollectibleAwarded(class UGlimpseCollectibleGroup* Group, const struct FName& CollectibleKey);
	void OnCharacterEndUsableInteraction(class APawn* UseSource, class AActor* UseTarget);
	void OnCharacterCompleteUsableInteraction(class APawn* UseSource, class AActor* UseTarget);
	void OnCharacterCompleteInteraction(class APawn* InteractSource);
	void MoveInventoryToStash(bool includeHolster, bool includeClothing, bool includeQuest);
	void MarkQuestTracked(class UQuest* Quest);
	void ListQuests(const struct FString& Command);
	bool IsTutorialWidgetDisplayed();
	bool IsRecipeUnlocked(class UClass* RecipeType);
	bool IsProfileFlagSet(const struct FName& InName);
	bool IsPlayerMenuVisible();
	bool IsPlayerInputEnabled(TEnumAsByte<EGlimpsePlayerInput> Type);
	bool IsLoreViewed(const struct FName& LoreKey);
	bool IsInGameTipViewed(const struct FName& TipKey);
	bool IsCollectibleAwarded(class UGlimpseCollectibleGroup* Group, const struct FName& CollectibleKey);
	void HideQuestCompletionWidget();
	void HidePlayerMenu();
	void HideInGameTipByKey(const struct FName& TipKey);
	void HideInGameTip();
	void HideDeathMenu();
	int GetTutorialStep();
	bool GetTargetLocked();
	class UInteractionComponent* GetTargetInteraction(TEnumAsByte<EInteraction> InteractionType);
	class UInventoryComponent* GetStash();
	class UQuest* GetQuestInstance(class UClass* QuestType);
	int GetProfileFlag(const struct FName& InName);
	TEnumAsByte<EPlayerSuspicionLevel> GetPlayerSuspicionLevel();
	float GetPlayerMaxCarryWeightOffset();
	float GetPlayerCarriedWeightWarningLimit();
	TEnumAsByte<EGlimpseAnnoyingEvent> GetPlayerAnnoyedReason();
	bool GetObjectiveMapMarkerLocationAndRadius(class UClass* QuestType, const struct FName& QuestState, bool Get3DPosition, TArray<struct FVector>* MapMarkerLocations, TArray<float>* MapMarkersAreaRadius);
	bool GetObjectiveMapMarkerLocation(class UClass* QuestType, const struct FName& QuestState, bool Get3DPosition, TArray<struct FVector>* MapMarkerLocations);
	float GetMaxPlayerCarriedWeight();
	class AGlimpsePlayerCameraManager* GetGlimpsePlayerCameraManager();
	class AGlimpseHUD* GetGlimpseHUD();
	class AGlimpsePlayerCharacter* GetGlimpseCharacter();
	float GetGameplayCountdownTimeRemaining(const struct FName& CountdownReference);
	bool GetCurrentInputDeviceIsController();
	bool GetCanUseHandsForEquippablesOrItems();
	bool GetCanCraftWithStash();
	void Flashback(class UGlimpseCollectibleGroup* Group, const struct FName& CollectibleKey, float EaseOutTime, const struct FLatentActionInfo& LatentInfo, const struct FLinearColor& FadeColor);
	void EnablePlayerInput(TEnumAsByte<EGlimpsePlayerInput> Type, bool bActivate);
	void EnableCombatInput(bool bActivate);
	void DumpGlimpseStats();
	void DebugShowTutorialWidget(const struct FName& TipKey);
	void DebugShowDeathMenu();
	void DebugQuest(const struct FString& Command);
	void ClearProfileFlag(const struct FName& InName);
	void ClearOverrideConformityRequests();
	bool CanShowPlayerMenu();
	void AwardCollectible(class UGlimpseCollectibleGroup* Group, const struct FName& CollectibleKey);
	void AwardAchievement(const struct FString& AchievementName);
	void AutoSave();
	void AutoLoad();
	void AllowShowSkipBoxInCutsceneWidget(bool Show);
	void AddOverrideConformityRequest(const struct FName& InRequest);
	void AddGameplayCountdown(const struct FName& CountdownReference, float Duration);
};


// Class GlimpseGame.CharacterState
// 0x0018 (0x0040 - 0x0028)
class UCharacterState : public UObject
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0028(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.CharacterState");
		return ptr;
	}

};


// Class GlimpseGame.CharacterStateMachineComponent
// 0x0020 (0x0110 - 0x00F0)
class UCharacterStateMachineComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x00F0(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.CharacterStateMachineComponent");
		return ptr;
	}

};


// Class GlimpseGame.CharacterStateHitReaction
// 0x00C8 (0x0108 - 0x0040)
class UCharacterStateHitReaction : public UCharacterState
{
public:
	unsigned char                                      UnknownData00[0xC8];                                      // 0x0040(0x00C8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.CharacterStateHitReaction");
		return ptr;
	}

};


// Class GlimpseGame.CharacterStateBlock
// 0x0010 (0x0050 - 0x0040)
class UCharacterStateBlock : public UCharacterState
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0040(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.CharacterStateBlock");
		return ptr;
	}

};


// Class GlimpseGame.CharacterStateMantle
// 0x0020 (0x0060 - 0x0040)
class UCharacterStateMantle : public UCharacterState
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0040(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.CharacterStateMantle");
		return ptr;
	}

};


// Class GlimpseGame.CharacterStateCarryCorpse
// 0x0028 (0x0068 - 0x0040)
class UCharacterStateCarryCorpse : public UCharacterState
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0040(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.CharacterStateCarryCorpse");
		return ptr;
	}


	void OnCorpseHitCallback(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
};


// Class GlimpseGame.CharacterStateCombatMove
// 0x02D8 (0x0318 - 0x0040)
class UCharacterStateCombatMove : public UCharacterState
{
public:
	unsigned char                                      UnknownData00[0x2D8];                                     // 0x0040(0x02D8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.CharacterStateCombatMove");
		return ptr;
	}

};


// Class GlimpseGame.CharacterStateParry
// 0x0010 (0x0050 - 0x0040)
class UCharacterStateParry : public UCharacterState
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0040(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.CharacterStateParry");
		return ptr;
	}

};


// Class GlimpseGame.CharacterStateLanding
// 0x0018 (0x0058 - 0x0040)
class UCharacterStateLanding : public UCharacterState
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0040(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.CharacterStateLanding");
		return ptr;
	}

};


// Class GlimpseGame.InteractionComponent
// 0x0200 (0x02F0 - 0x00F0)
class UInteractionComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x200];                                     // 0x00F0(0x0200) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GlimpseGame.InteractionComponent");
		return ptr;
	}


	void TickInteraction(class APawn* InteractSource, float DeltaSeconds);
	bool ShouldShowPrompt();
	void SetToggleableSecondaryInteractionEnabled(bool bEnable);
	bool IsBeingInteracted();
